##  Terraform Plan — DEV Environment
 | Step | Result |
 |------|--------|
 | Format | `success` |
 | Validate | `success` |
 | Plan | `success` |

 <details><summary>Show Plan Output</summary>

 ```
 Acquiring state lock. This may take a few moments...
module.vpc.data.aws_availability_zones.available: Reading...
module.bastion.data.aws_ami.ubuntu: Reading...
module.eks.data.aws_iam_policy_document.eks_node_assume_role_policy: Reading...
module.eks.data.aws_iam_policy_document.eks_cluster_assume_role_policy: Reading...
module.eks.data.aws_iam_policy_document.eks_cluster_assume_role_policy: Read complete after 0s [id=3552664922]
module.eks.data.aws_iam_policy_document.eks_node_assume_role_policy: Read complete after 0s [id=2851119427]
module.vpc.data.aws_availability_zones.available: Read complete after 1s [id=ap-southeast-1]
module.bastion.data.aws_ami.ubuntu: Read complete after 1s [id=ami-0c1d28734eb221b6d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.bastion.aws_instance.bastion_host["0"] will be created
  + resource "aws_instance" "bastion_host" {
      + ami                                  = "ami-0c1d28734eb221b6d"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "bastion-host"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "KLTN-Bastion-Host-1"
        }
      + tags_all                             = {
          + "Name" = "KLTN-Bastion-Host-1"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # module.bastion.aws_instance.bastion_host["1"] will be created
  + resource "aws_instance" "bastion_host" {
      + ami                                  = "ami-0c1d28734eb221b6d"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "bastion-host"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "KLTN-Bastion-Host-2"
        }
      + tags_all                             = {
          + "Name" = "KLTN-Bastion-Host-2"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # module.bastion.aws_security_group.allow_ssh will be created
  + resource "aws_security_group" "allow_ssh" {
      + arn                    = (known after apply)
      + description            = "Allow SSH inbound traffic to Bastion Hosts"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH from allowed CIDR only"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "bastion-ssh-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "KLTN-Bastion-Host-sg"
        }
      + tags_all               = {
          + "Name" = "KLTN-Bastion-Host-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.eks_cluster_logs will be created
  + resource "aws_cloudwatch_log_group" "eks_cluster_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/eks/mlops-infr-dev-eks/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "mlops-infr-dev-eks-logs"
        }
      + tags_all          = {
          + "Name" = "mlops-infr-dev-eks-logs"
        }
    }

  # module.eks.aws_eks_cluster.main will be created
  + resource "aws_eks_cluster" "main" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "mlops-infr-dev-eks"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Name" = "mlops-infr-dev-eks"
        }
      + tags_all                      = {
          + "Name" = "mlops-infr-dev-eks"
        }
      + version                       = "1.32"

      + access_config (known after apply)

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = false
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.main will be created
  + resource "aws_eks_node_group" "main" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "mlops-infr-dev-eks"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "mlops-infr-dev-eks-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name" = "mlops-infr-dev-eks-node-group"
        }
      + tags_all               = {
          + "Name" = "mlops-infr-dev-eks-node-group"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 4
          + min_size     = 2
        }

      + update_config {
          + max_unavailable_percentage = 50
        }
    }

  # module.eks.aws_iam_role.eks_cluster_role will be created
  + resource "aws_iam_role" "eks_cluster_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "mlops-infr-dev-eks-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.aws_iam_role.worker_nodes_role will be created
  + resource "aws_iam_role" "worker_nodes_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "mlops-infr-dev-eks-worker-nodes-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.eks_cluster_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "mlops-infr-dev-eks-cluster-role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_vpc_resource_controller will be created
  + resource "aws_iam_role_policy_attachment" "eks_vpc_resource_controller" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "mlops-infr-dev-eks-cluster-role"
    }

  # module.eks.aws_iam_role_policy_attachment.worker_nodes_cni_policy will be created
  + resource "aws_iam_role_policy_attachment" "worker_nodes_cni_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "mlops-infr-dev-eks-worker-nodes-role"
    }

  # module.eks.aws_iam_role_policy_attachment.worker_nodes_policy will be created
  + resource "aws_iam_role_policy_attachment" "worker_nodes_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "mlops-infr-dev-eks-worker-nodes-role"
    }

  # module.eks.aws_iam_role_policy_attachment.worker_nodes_registry_policy will be created
  + resource "aws_iam_role_policy_attachment" "worker_nodes_registry_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "mlops-infr-dev-eks-worker-nodes-role"
    }

  # module.eks.aws_launch_template.eks_nodes will be created
  + resource "aws_launch_template" "eks_nodes" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Launch template for EKS worker nodes"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "mlops-infr-dev-eks-node-lt-"
      + tags                   = {
          + "Name" = "mlops-infr-dev-eks-node-lt"
        }
      + tags_all               = {
          + "Name" = "mlops-infr-dev-eks-node-lt"
        }
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }
    }

  # module.security_group.aws_security_group.eks_control_plane will be created
  + resource "aws_security_group" "eks_control_plane" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS control plane - Kubernetes API access"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Kubernetes API - HTTPS from VPC only"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "KLTN-Project-DEV-eks-cp-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "KLTN-Project-DEV-eks-control-plane-sg"
        }
      + tags_all               = {
          + "Name" = "KLTN-Project-DEV-eks-control-plane-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_group.aws_security_group.eks_worker_nodes will be created
  + resource "aws_security_group" "eks_worker_nodes" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS worker nodes - pod, node, and control plane communication"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "CNI overlay (VXLAN/Geneve) - inter-node pod networking"
              + from_port        = 4789
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 4789
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "DNS (TCP) - CoreDNS fallback for large responses"
              + from_port        = 53
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 53
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "DNS (UDP) - CoreDNS service resolution"
              + from_port        = 53
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 53
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Ephemeral TCP ports - pod and inter-node communication"
              + from_port        = 1025
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "NodePort services - Kubernetes NodePort range"
              + from_port        = 30000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 32767
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "KLTN-Project-DEV-eks-nodes-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "KLTN-Project-DEV-eks-worker-nodes-sg"
        }
      + tags_all               = {
          + "Name" = "KLTN-Project-DEV-eks-worker-nodes-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_group.aws_security_group_rule.control_plane_to_nodes_https will be created
  + resource "aws_security_group_rule" "control_plane_to_nodes_https" {
      + description              = "HTTPS from EKS control plane (webhook aggregation)"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.security_group.aws_security_group_rule.control_plane_to_nodes_kubelet will be created
  + resource "aws_security_group_rule" "control_plane_to_nodes_kubelet" {
      + description              = "Kubelet API - from EKS control plane"
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.security_group.aws_security_group_rule.nodes_to_control_plane_https will be created
  + resource "aws_security_group_rule" "nodes_to_control_plane_https" {
      + description              = "Kubernetes API - HTTPS from worker nodes"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.vpc.aws_eip.eip_nat["0"] will be created
  + resource "aws_eip" "eip_nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "KLTN-Project-DEV-eip-1"
        }
      + tags_all             = {
          + "Name" = "KLTN-Project-DEV-eip-1"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_eip.eip_nat["1"] will be created
  + resource "aws_eip" "eip_nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "KLTN-Project-DEV-eip-2"
        }
      + tags_all             = {
          + "Name" = "KLTN-Project-DEV-eip-2"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.internet_gateway will be created
  + resource "aws_internet_gateway" "internet_gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "KLTN-Project-DEV-igw"
        }
      + tags_all = {
          + "Name" = "KLTN-Project-DEV-igw"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.nat_gateway["0"] will be created
  + resource "aws_nat_gateway" "nat_gateway" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "KLTN-Project-DEV-nat-1"
        }
      + tags_all                           = {
          + "Name" = "KLTN-Project-DEV-nat-1"
        }
    }

  # module.vpc.aws_nat_gateway.nat_gateway["1"] will be created
  + resource "aws_nat_gateway" "nat_gateway" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "KLTN-Project-DEV-nat-2"
        }
      + tags_all                           = {
          + "Name" = "KLTN-Project-DEV-nat-2"
        }
    }

  # module.vpc.aws_route_table.private_route_table["0"] will be created
  + resource "aws_route_table" "private_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "KLTN-Project-DEV-private-rt-1"
        }
      + tags_all         = {
          + "Name" = "KLTN-Project-DEV-private-rt-1"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private_route_table["1"] will be created
  + resource "aws_route_table" "private_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "KLTN-Project-DEV-private-rt-2"
        }
      + tags_all         = {
          + "Name" = "KLTN-Project-DEV-private-rt-2"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public_route_table will be created
  + resource "aws_route_table" "public_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "KLTN-Project-DEV-public-rt"
        }
      + tags_all         = {
          + "Name" = "KLTN-Project-DEV-public-rt"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private["0"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private["1"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public["0"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public["1"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnet["0"] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                     = "KLTN-Project-DEV-private-subnet-1"
          + "kubernetes.io/cluster/mlops-infr-dev-eks" = "shared"
          + "kubernetes.io/role/internal-elb"          = "1"
        }
      + tags_all                                       = {
          + "Name"                                     = "KLTN-Project-DEV-private-subnet-1"
          + "kubernetes.io/cluster/mlops-infr-dev-eks" = "shared"
          + "kubernetes.io/role/internal-elb"          = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnet["1"] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                     = "KLTN-Project-DEV-private-subnet-2"
          + "kubernetes.io/cluster/mlops-infr-dev-eks" = "shared"
          + "kubernetes.io/role/internal-elb"          = "1"
        }
      + tags_all                                       = {
          + "Name"                                     = "KLTN-Project-DEV-private-subnet-2"
          + "kubernetes.io/cluster/mlops-infr-dev-eks" = "shared"
          + "kubernetes.io/role/internal-elb"          = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnet["0"] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                     = "KLTN-Project-DEV-public-subnet-1"
          + "kubernetes.io/cluster/mlops-infr-dev-eks" = "shared"
          + "kubernetes.io/role/elb"                   = "1"
        }
      + tags_all                                       = {
          + "Name"                                     = "KLTN-Project-DEV-public-subnet-1"
          + "kubernetes.io/cluster/mlops-infr-dev-eks" = "shared"
          + "kubernetes.io/role/elb"                   = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnet["1"] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                     = "KLTN-Project-DEV-public-subnet-2"
          + "kubernetes.io/cluster/mlops-infr-dev-eks" = "shared"
          + "kubernetes.io/role/elb"                   = "1"
        }
      + tags_all                                       = {
          + "Name"                                     = "KLTN-Project-DEV-public-subnet-2"
          + "kubernetes.io/cluster/mlops-infr-dev-eks" = "shared"
          + "kubernetes.io/role/elb"                   = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "KLTN-Project-DEV-vpc"
        }
      + tags_all                             = {
          + "Name" = "KLTN-Project-DEV-vpc"
        }
    }

Plan: 36 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bastion_public_ips                  = {
      + "0" = (known after apply)
      + "1" = (known after apply)
    }
  + cluster_certificate_authority_data  = (sensitive value)
  + cluster_endpoint                    = (known after apply)
  + cluster_id                          = (known after apply)
  + cluster_name                        = "mlops-infr-dev-eks"
  + cluster_oidc_issuer_url             = (known after apply)
  + cluster_security_group_id           = (known after apply)
  + cluster_version                     = "1.32"
  + configure_kubectl                   = "aws eks update-kubeconfig --name mlops-infr-dev-eks --region ap-southeast-1"
  + eks_control_plane_security_group_id = (known after apply)
  + eks_worker_nodes_security_group_id  = (known after apply)
  + node_group_id                       = (known after apply)
  + node_group_status                   = (known after apply)
  + private_subnet_ids                  = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids                   = [
      + (known after apply),
      + (known after apply),
    ]
  + vpc_cidr                            = "10.0.0.0/16"
  + vpc_id                              = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

 ```
 </details>

 ---
 > **To apply this plan**, trigger the [Terraform Apply](../actions/workflows/terraform-apply.yml) workflow and enter:
 > - Environment: `dev`
 > - Plan Commit SHA: `bb757f16fd50beb3a57dd2f3abb625ab41fdccc5`

 >*Commit: `bb757f16fd50beb3a57dd2f3abb625ab41fdccc5`*